function randomQuotesGenerator() {
  let random_quotes = [
    " (مولانا جلال الدین رومی) آپ کا کام محبت کی تلاش نہیں بلکہ آپ کے اندر موجود تمام رکاوٹوں کی تلاش کرنا ہے جو آپ نے محبت کے خلاف کھڑی کی ہیں۔",

    "     (میرزا غالب)  دل ہی تو ہے نہ سنگ و خشت، درد سے بھر نہ آئے کیوں۔ روئیں گے ہم ہزار بار، کوئی ہمیں ستائے کیوں۔",

"         (احمد فراز)  سنا ہے بولے تو باتوں سے پھول جھڑتے ہیں، یہ بات ہے تو چلو بات کر کے دیکھتے ہیں۔",

"   ( پروین شاکر)  خوشبو کی طرح میری ہر سانس میں رہنا، ہاں وقت کا تقاضا ہے، دن رات میں رہنا۔" ,

"    (جون ایلیا) محبت خود بتاتی ہے، کہاں کس کا ٹھکانہ ہے، کسے جینا ہے مر مر کے، کسے مر کر بھی جینا ہے۔",

"  (فیض احمد فیض) گلوں میں رنگ بھرے باد نو بہار چلے، چلے بھی آؤ کہ گلشن کا کاروبار چلے۔",

"  (منیر نیازی)  ہمیشہ دیر کر دیتا ہوں میں، ضروری بات کہنی ہو، کوئی وعدہ نبھانا ہو، اسے آواز دینی ہو، اسے واپس بلانا ہو۔ ",

"        (ساغر صدیقی) دنیا نے تجربات و حوادث کی شکل میں، جو کچھ مجھے دیا ہے وہ لوٹا رہا ہوں میں۔",

"            (اقبال) ستاروں سے آگے جہاں اور بھی ہیں، ابھی عشق کے امتحان اور بھی ہیں۔",

"           (احمد ندیم قاسمی)  وہ آئے بزم میں اتنا تو برق نے دیکھا، پھر اس کے بعد چراغوں میں روشنی نہ رہی۔",

"                    (جوش ملیح آبادی) آدمی کو بھی میسر نہیں انسان ہونا۔",

"      (غلام محمد قاصر)    وہ ایک بات کہ جو تھی بڑی گراں سب پر، میں ہنس دیا تھا تو ہنسنے کی بات رہنے دی۔",

   "  (محسن نقوی)   یاد آئے گا صدیوں تک بھلانے کے باوجود بھی، کسی نے رو لیا مجھ کو ہنسانے کے باوجود بھی۔",

   "     (حبیب جالب)  ظلم رہے اور امن بھی ہو، کیا ممکن ہے تم ہی کہو۔",

   "      (منیر نیازی) اک اور دریا کا سامنا تھا منیر مجھ کو، میں ایک دریا کے پار اترا تو میں نے دیکھا۔",


  ];
  let randomQuotes = Math.random() * random_quotes.length;
  let roundQuotes = Math.floor(randomQuotes);
  let quotesGen = random_quotes[roundQuotes];

  let quote = document.querySelector("#quote");
  quote.innerText = `" ${quotesGen} "`;
}
